#include <iostream> 
using namespace std;
int main() {setlocale(0, "");

    int sum = 0, input;

    cout << "[1]Первый элемент в таблице Менделеева — это…\n1)Магний    2)Железо    3)Водород\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[2]Кто открыл Америку?\n1)Васко да Гама     2)Диего Колон   Христофор Колумб\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[3]Как называется корабль Джека Воробья из фильма «Пираты Карибского моря»?\n1)Летучий Голландец    2)Месть королевы Анны    3)Черная жемчужина\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[4]Какая планета расположена ближе всех к Солнцу?\n1)Марс    2)Венера   3)Меркурий\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[5]Как правильно поставить ударение?\n1)крапивА    2)крАпива    3)крапИва\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[6]Сколько клеток на шахматной доске?\n1)32    2)16    3)64\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[7]Что быстрее: свет или звук?\n1)Звук    2)Равны    3)Свет\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[8]Расшифруйте аббревиатуру СССР.\n1)Союз Социалистических Советских Республик    2)Содружество Советских Социалистических Республик    3)Союз Советских Социалистических Республик\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[9]Как часто проводятся Олимпийские игры?\n1)Раз в три года    2)Каждый год    3)Раз в четыре года\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[10]В каком году в России отменили крепостное право?\n1)В 1784 году    2) 1592 году    3)В 1861 году\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[11]Где находится мыс Доброй Надежды?\n1)Южная Америка    2)Евразия    3)Африка\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[12]В какой стране национальной валютой является Вона?\n1)Китай    2)Япония    3)Южная Корея\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[13]Назовите синоним слова «сентиментальный».\n1)Добрый    2)Наглый    3)Чувствительный\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[14]Что появляется у старого анекдота?\n1)Ноги    2)Хвост    3)Борода\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[15]Сколько мышц в теле человека?\n1)Около 800    2)Около 300    3)Около 650\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[16]В какой стране родился первооткрыватель Васко да Гама?\n1)Италия    2)Испания    3)Португалия\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[17]После гибели Гектора на помощь троянцам пришли именно они; их царица пала в поединке с Ахиллом\n1)Аргонавты    2)Воины Микен    3)Амазонки\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[18]Сколько сезонов реальных пацанов?\n1)13    2)9    3)10\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[19]Когда родился Пушкин\n1)1899 2)2017 3)1799\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
    cout << "[20]Сколько байтов в бите?\n1)16    2)1024    3)8\n" << endl;
    cin >> input;
    input == 3 ? cout << "Верно\n" : cout << "Неверно\n";
}

    